/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (+%2$d أخرى)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "فشل استخراج الملف \"%1$@\" من الأرشيف \"%2$@\": %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "فشل استخراج البيانات الملحقة بالملف \"%1$@\" من الأرشيف \"%2$@\": \n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "الترميز الافتراضي";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "اكتشاف تلقائي";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "استخراج";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "استخراج الأرشيف";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "يجري الاستخراج \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "يجري التحضير للاستخراج \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "تحديد";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "حدد ملفات لاستخراج محتواها";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "لا يمكن استخراج محتوى الملف \"%@\" بهذا البرنامج";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "حدث خطأ أثناء استخراج محتوى الملف \"%1$@\": %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "حدث خطأ أثناء قراءة محتوى الملف \"%1$@\": %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "استخراج";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "يجب توفير كلمة المرور لفتح الأرشيف \"%@\".";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "إلى أين سيستخرج The Unarchiver محتوى الأرشيف؟";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "هل تود استخراج ملفات الأرشيف إلى نفس المجلد الحاوي لها، أم أنك تفضل تحديد مكان المجلد الهدف لكل أرشيف على حدة";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "السؤال في كل مرة";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "استخراج الأرشيف إلى نفس المجلد الحاوي له";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "لم يتمكن The Unarchiver من الكتابة في هذا المجلد. قد تحجب تقنية ساند بوكس في نظام التشغيل ماك الوصول للمجلد. انقر على \"استخراج\" لتطلب من ساند بوكس السماح لـ The Unarchiver بالكتابة فيه. وسيتم حفظ هذا الإذن ولن يحتاج The Unarchiver إلى طلبه مجددًا";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." =  "يحتاج تطبيق The Unarchiver للبحث عن الأجزاء الأخرى لهذا الأرشيف، ولكن تقنية ساند بوكس في نظام التشغيل ماك تحجب الوصول للمجلد. لطلب الإذن من تقنية ساند بوكس بالسماح في البحث ضمن هذا المجلد، انقر على \"بحث\". سيتم حفظ هذا الإذن ولن يحتاج The Unarchiver إلى طلبه مجددًا.";

/* Panel OK button title when searching for more archive parts */
"Search" = "بحث";
/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */

/* Common errors */
"Attempted to read more data than was available" = "ملف الأرشيف غير كامل";
"Opening file failed" = "لا يمكن فتح الملف";
"Missing or wrong password" = "كلمة المرور خاطئة";
"Wrong checksum" = "ملف الأرشيف معطوب";
"Could not create directory" = "فشل إنشاء المجلد";

/* Uncommon or unused errors */
"Unknown error" = "خطأ غير معروف";
"Failed to write to file" = "فشلت الكتابة في الملف";
"Function called with illegal parameters" = "استُدعيت الدالة بوسطاء خاطئة";
"Not enough memory available" = "لا يتوفر ذاكرة كافية";
"Data is corrupted" = "البيانات معطوبة";
"File is not fully supported" = "الملف غير مدعوم بشكل كامل";
"Required resource missing" = "لم يُعثر على مورد مطلوب";
"Error on decrunching" = "حدث خطأ أثناء الاستخراج";
"Unknown file type" = "نوع الملف غير معروف";
"File, disk has been skipped" = "تم تخطي ملف، قرص";
"User cancelled extraction" = "ألغى المستخدم استخراج المتحوى";
"File already exists" = "الملف موجود مسبقًا";
"Verify failed (disk hook)" = "فشل التحقق ‪(‬disk hook‪)‬";
"Wrong drive geometry" = "خطأ في هندسة القرص";
"Unknown data format" = "صيغة البيانات غير معروفة";
"Source contains no files" = "المصدر لا يحوي ملفات";
"Unknown filesystem" = "نظام الملفات غير معروف";
"Name of file exists as directory" = "اسم الملف موجود مسبقًا كاسم لمجلد";
"Buffer was too short" = "التخزين المؤقت قصير للغاية";
"Text encoding was defective" = "يوجد خطأ في ترميز النص";
"Could not create symlink" = "فشل إنشاء الاختصار";
